MusicApp/app/models/user.rb

UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "xx3U3gNsvWJ9g5u9CVQROA"], ["updated_at", "2022-07-06 20:35:36.046175"], ["id", 12]]
---
    def reset_session_token
        self.session_token = User.generate_session_token
        self.save!

SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "123"], ["LIMIT", 1]]
---
    def self.find_by_creditials(email, password)
        @user = User.find_by(email: email)